Revit 2027 API
RepeatingReferenceSource.GetBounds Method
 Returns information about the boundaries of the repeating reference array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RepeaterBounds GetBounds()
Public Function GetBounds As RepeaterBounds
public:
RepeaterBounds^ GetBounds()
member GetBounds : unit -> RepeaterBounds
Return Value
RepeaterBounds
 The bounds of the repeating reference source.
Exceptions
Exception | Condition
InvalidOperationException |  The repeating reference source is no longer valid.
Remarks
 See the RepeaterBounds structure for more information about repeating reference source bounds.
See Also
Reference
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace